Repository: Qowaiv/qowaiv-validation
Catalog: src/Qowaiv.Validation.DataAnnotations/QowaivValidationMessages.*.resx
Languages: nl

# AllowedValuesAttribute_ValidationError
source: The value of the {0} field is not allowed.
nl: De waarde van het veld {0} is niet toegestaan.

# Collection_AtLeast_ValidationError
source: The {0} field should have at least {1} items.
nl: Veld {0} moet tenminste {1} items bevatten.

# Collection_AtMost_ValidationError
source: The {0} field should have at most {1} items.
nl: Veld {0} mag niet meer dan {1} items bevatten.

# Collection_InRange_ValidationError
source: The number of items of the {0} field should be between {1} and {2}.
nl: Het aantal items van veld {0} moet tussen {1} en {2} zitten.

# DistinctValuesAttribute_ValidationError
source: All values of the {0} field should be distinct.
nl: Alle waarden van het veld {0} zouden verschillend moeten zijn.

# InFuture
source: The value of the {0} field should be in the future.
nl: De waarde van het {0} veld moet in de toekomst liggen.

# InPast
source: The value of the {0} field should be in the past.
nl: De waarde van het {0} veld moet in het verleden liggen.

# IsFiniteAttribute_ValidationError
source: The value of the {0} field is not a finite number.
nl: De waarde van het {0} veld is geen eindig getal.

# Length_AtLeast_ValidationError
source: The length of the {0} field should be at least {1}.
nl: De lengte van het veld {0} moet minstens {1} zijn.

# Length_AtMost_ValidationError
source: The length of the {0} field should be at most {1}.
nl: De lengte van het veld {0} mag niet meer dan {1} zijn.

# Length_InRange_ValidationError
source: The length of the {0} field should be between {1} and {2}.
nl: De lengte van het veld {0} moet tussen de {1} en {2} zijn.

# MandatoryAttribute_ValidationError
source: The {0} field is required.
nl: Het veld {0} is verplicht.

# MultipleOfAttribute_ValidationError
source: The value of the {0} field is not a multiple of {1}.
nl: De waarde van veld {0} is geen veelvoud van {1}.

# NotInFuture
source: The value of the {0} field should not be in the future.
nl: De waarde van veld {0} mag niet in de toekomst liggen.

# NotInPast
source: The value of the {0} field should not be in the past.
nl: De waarde van veld {0} mag niet in het verleden liggen.

# Size_AtLeast_ValidationError
source: The size of the {0} field should be at least {1: F}.
nl: De grootte van het veld {0} moet minstens {1: F} zijn.

# Size_AtMost_ValidationError
source: The size of the {0} field should be at most {1: F}.
nl: De grootte van het veld {0} mag niet meer dan {1: F} zijn.

# Size_InRange_ValidationError
source: The size of the {0} field should be between {1: F} and {2: F}.
nl: De grootte van het veld {0} moet tussen de {1: F} en {2: F} zijn.

# UniqueValuesAttribute_ValidationError
source: All values of the {0} field should be unique.
nl: Alle waarden van het veld {0} zouden verschillend moeten zijn.
