Repository: Qowaiv/qowaiv-validation
Catalog: src/Qowaiv.Validation.Fluent/QowaivValidationFluentMessages.*.resx
Languages: nl

# InFuture
source: '{PropertyName}' should be in the future.
nl: '{PropertyName}' moet in de toekomst liggen.

# InPast
source: '{PropertyName}' should be in the past.
nl: '{PropertyName}' moet in het verleden liggen.

# IsFinite
source: '{PropertyName}' must be a finite number.
nl: '{PropertyName}' moet een eindig getal zijn.

# NoIPBasedEmailAddress
source: '{PropertyName}' has a IP address based domain.
nl: '{PropertyName}' heeft een IP-adres als domein.

# NotEmptyOrUnknown
source: '{PropertyName}' must not be empty or unknown.
nl: '{PropertyName}' mag niet leeg of onbekend zijn.

# NotInFuture
source: '{PropertyName}' should not be in the future.
nl: '{PropertyName}' mag niet in de toekomst liggen.

# NotInPast
source: '{PropertyName}' should not be in the past.
nl: '{PropertyName}' mag niet in het verleden liggen.

# NotUnknown
source: '{PropertyName}' must not be unknown.
nl: '{PropertyName}' mag niet onbekend zijn.

# PostalCodeValidForCountry
source: '{PropertyName}' {Value} is not valid for {Country}.
nl: '{PropertyName}' {ComparisonValue} is niet geldig voor {Country}.

# Required
source: '{PropertyName}' is required.
nl: '{PropertyName}' is verplicht.
